app/controllers/plants_controller.rb

	def index
		@plants = Plant.all
---
SELECT "plants".* FROM "plants"

	def show
		@plant = Plant.find(params[:id])
---
SELECT  "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@plant = Plant.new(plant_params)

		@plant.save
---
INSERT INTO "plants" ("name", "frequency", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "plant1"], ["frequency", "hi"], ["created_at", "2018-02-11 20:52:20.790919"], ["updated_at", "2018-02-11 20:52:20.790919"]]